#include <stdio.h>

int main() {
	// -0 => 别忘记符号位1
	// Hex		M		E		V		D
	// 0x8000	0		-14		-0		-0.0


	// 最小的>2的值 => 10.0...01(二进制)
	// Hex		M		E		V		D
	// 0x4001  1025/1024 1	1025/512	2.001953125

	// 512 => 
	// Hex		M		E		V		D
	// 0x6200	1	   9		512		512.0

	// 最大的非规格化数 => bigest denormalized
	// Hex		M		E		V		D
	// 0x03FF  1023/1024 -14  1023 / (2^10 * 2^(14))  6.09755516e-5

	// -∞ => 
	// Hex		M		E		V		D
	// 0xFC00	-		-		-		-

	// 十六进制表示为0x3BB0 => 
	// Hex		M		E		V		D
	// 0x3BB0  123/64	-1		123/128 0.9609375





}